# 문제1: 다음 데이터를 사용하여 df라는 이름의 DataFrame을 만드시오
# 제품 : ['사과','배','바나나','사과','바나나']
# 가격 : 2500, 3000, 1500, 2500, 1200
# 판매량: [10,5,20,8,15]
# 데이터의 상위 3개 행만 출력하시오
# 판매량의 평균값을 구하시오.

import pandas as pd

data1 = {'사과': [2500,10],
        '배':[3000, 5],
        '바나나':[1500,20],
        '사과':[2500,8],
        '바나나':[1200,15]}
columns_list = ['사과','배','바나나','사과','바나나']
index_list = ['가격', '판매량']
df1 = pd.DataFrame(data1,columns=columns_list, index=index_list)
#print(df1)

data = {
    '제품':['사과','배','바나나','사과','바나나'],
    '가격':[2500, 3000, 1500, 2500, 1200],
    '판매량': [10,5,20,8,15]
}
df = pd.DataFrame(data)
print(df[0:3])
print(df.describe())
# 가격       판매량
# count     5.000000   5.00000
# mean   2140.000000  11.60000
# std     756.967635   5.94138
# min    1200.000000   5.00000
# 25%    1500.000000   8.00000
# 50%    2500.000000  10.00000
# 75%    2500.000000  15.00000
# max    3000.000000  20.00000