# 예외 처리의 필요성
# 1. 예외와 오류
# 예외 exception: 개발자가 직접 처리할 수 있는 간단한 문제
# 오류 error : 개발자가 처리할 수 없는 복잡한 문제

# 2. 예외 처리의 필요성
# 예외 처리의 목적은 어떤 문제가 발생했을 대 그 문제를 해결해주는 것이 아니라
# 비정상적으로 종료되는 것을 막고 사용자에게 발생한 문제에 대한 정보를 전달하기 위함

# 예외 처리를 하게 되면 아래와 같이 처리 가능
# print(2/0)
# 0으로 나눌 수 없습니다.

# 예외처리
# 1. 고전적인 예외처리
# 개발자가 처리

a = int(input('제수를 입력하세요 >>'))
b = int(input('피제수를 입력하세요>>'))

if b == 0:
    print('0으로 나누는 것은 불가능합니다.')
else:
    print(f'{a} / {b} = {a/b}')

# 고전적인 예외 처리 방식의 문제점
# 1) 어떤 문제가 발생했는지 예상할 수 있어야 대비가 가능
# 2) 어떤 문제가 발생할지 예상을 하더라도 대비할 수 없는 경우가 있음

try:
    a = int(input('제수를 입력하세요 >>'))
    b = int(input('피제수를 입력하세요>>'))
    print(f'{a} / {b} = {a/b}')
except:
    print('예외가 발생했습니다.')
    # 피제수에 0을 입력해서 의도적으로 예외 발생
    # 제수에 실수 1.5를 입력해서 의도적으로 예외 발생

try:
    print('의도적 예외')
    a = int(input('제수를 입력하세요 >>'))
    b = int(input('피제수를 입력하세요>>'))
    print(f'{a} / {b} = {a / b}')
except ZeroDivisionError:
    print('0으로 나눌 수 없습니다.')
except ValueError:
    print('정수만 입력할 수 있습니다.')

# 3) 예외 메시지 처리하기
# 지금까지는 모든 예외 미시지를 직접 만들어서 사용
# 하지만 모든 예외는 기본 예외 미시지를 가지고 있음
# 예외들이 가지고 있는 예외 메시지를

# except 예외 as 예외 메시지:
# 예외 발생 시 처리 영역

a = [10,20,30,40,50]

try:
    a[10]
except IndexError as e:
    print(e) # list index out of range